In [34]:
import numpy as np
import pandas as pd
import matplotlib as plt

df1 = pd.DataFrame({ 'key' : ['b','b','a','c','a','a','b',], 'data1' : range(7)})
df2 = pd.DataFrame({'key' : ['a','b','c'], 'data2' : range(3)})
#print(df1)
#print(df2)
#pd.merge(df1, df2)
#pd.merge(df1, df2, on='key')
#pd.merge(df1, df2, left_on='key')
#pd.merge(df1, df2, right_on='key')
#rint(pd.merge(df1, df2, on='key', how='inner'))

#df3 = pd.DataFrame({'key' : ['b','c','a'], 'data1' : range(3)})
#df4 = pd.DataFrame({'key' : ['a','b','c'], 'data2' : range(3)})
#print(df3)
#print(df4)

df3 = pd.DataFrame({'id' : [1,2, 3], 'Name' : ['Tom', 'Amy', 'Thomas'], 'subject_id' : ['sub1', 'sub2', 'sub3']})
df4 = pd.DataFrame({'id' : [1,2, 3], 'Name' : ['Kate', 'John', 'Betty'],'subject_id' : ['sub2', 'sub4', 'sub5']})
print(df3)
print(df4)

df5 = pd.merge(df3, df4, on='subject_id', how='left')
df5
df6 = pd.merge(df3, df4, on=['id','subject_id'], how='left')
df6

     Name  id subject_id
0     Tom   1       sub1
1     Amy   2       sub2
2  Thomas   3       sub3
    Name  id subject_id
0   Kate   1       sub2
1   John   2       sub4
2  Betty   3       sub5

   Name_x  id subject_id Name_y
0     Tom   1       sub1    NaN
1     Amy   2       sub2    NaN
2  Thomas   3       sub3    NaN

In [42]:
data = pd.Series(['Tom', 'John', 'Amy', np.nan, 'Tomas'])
data
data.isnull()
data.fillna(0, inplace=True)
#data.dropna()
data

0      Tom
1     John
2      Amy
3        0
4    Tomas
dtype: object

In [51]:
data2 = pd.DataFrame(np.random.randn(7,3))
data2
data2.iloc[:4, 1] = np.nan
data2.iloc[:2, 2] = np.nan
data2
#data2.dropna()

          0         1         2
0  1.012827       NaN       NaN
1 -0.206068       NaN       NaN
2  0.130403       NaN  1.026863
3  0.760153       NaN  3.251385
4  1.700615 -1.473364 -1.060287
5 -2.575863  0.228325 -1.542489
6 -0.419041  1.260895 -1.192682